{
    "personal_info": {
        "first_name": "Dylan",
        "last_name": "Spence",
        "email": "dylanspence705607@gmail.com",
        "phonenumber": "+1 321-292-4540"
    },
    "links": {
        "github": "https://github.com/Drs2001",
        "linkedin": "https://www.linkedin.com/in/dylan-spence-999036234/"
    },
    "experience": [
        {
            "company": "Precision Optical Technologies",
            "location": "Rochester, NY",
            "dates": "January 2024 - August 2024",
            "title": "Software Engineering Co-op",
            "description": "Added internal data analytic features to web server, providing actionable insights for the production, sales, and engineering teams. Collaborated on cross-platform (iOS, Android, Windows) app development used by customers to interface with custom hardware.",
            "link": "https://www.precisionot.com/"
        },
        {
            "company": "MKS Instruments",
            "location": "Rochester, NY",
            "dates": "January 2023 - July 2023",
            "title": "Software Engineering Co-op",
            "description": "Developed automation scripts to generate Windows .exe installers for various projects, significantly improving testing efficiency for the team. Additionally, contributed to the development and maintenance of the core DLL shared by all RF generators.",
            "link": "https://www.mks.com/"
        },
        {
            "company": "Mimio LLC",
            "location": "Remote",
            "dates": "July 2022 - December 2022",
            "title": "App Developer",
            "description": "Designed and implemented the underlying architecture of a cross-platform messaging application. Developed a novel syllable analysis engine for identifying Haiku poems within messages.",
            "link": "https://apps.apple.com/us/app/haikumi/id1632097536"
        }
    ],
    "about": {
        "summary": "I was originally born in Daytona Beach Florida, but I don’t remember much from my time there as my family moved away when I was still very young. This was the first in a long line of moves I would later go on to do, starting with Michigan, then Virginia, back to Florida, then Maryland, back to Virginia again, and then finally New York which is where I currently live. Most people think moving around that much is a bad thing, but I never viewed it this way. I looked at it as a way to see new places and meet all kinds of people and actually started looking forward to moving. I also look back at how moving so much grew some very useful skills of mine like flexibility and adaptability. Aside from having moved around, some hobbies I picked up along the way include a love for Soccer, Bouldering, computer building, cooking, sports in general, programming, Homelabbing, and gaming to name a few. It was these hobbies and interests that shaped my path forward and ultimately led me to pursue a degree in Computer Science, as from an early age I’ve been fascinated with computers and how they work. My goal moving forward is to take the degree I’ve earned and use it to contribute to a software project in a meaningful way. I love problem solving and look forward to seeing how I can use the skills I’ve learned to solve complex problems.",
        "interests": [
            {
                "name": "Soccer",
                "image": "/soccer.avif",
                "description": "I played soccer for about 12 years before stopping my senior year of high school after covid hit. Even though I no longer play I still like catching a BPL game every now and again. (The teams I root for are D.C United for MLS and Manchester United for BPL)"
            },
            {
                "name": "Pickleball",
                "image": "/pickleball.jpg",
                "description": "Only recently got into this sport, I enjoy playing casually with my friends when I get the chance."
            },
            {
                "name": "Bouldering",
                "image": "/bouldering.jpg",
                "description": "Been bouldering consistently for nearly 3 years now and absolutely love it. Bouldering is essentially rock climbing without a rope on shorter routes. I like to go to the gym around 3 times a week if I'm able. (If you're curious my current record for grade is V7 but difficulty depends a lot on setters.)"
            },
            {
                "name": "Health/ Fitness",
                "description": "If you couldn't tell by the amount of sports I have for hobbies I'm really into my health and fitness. Eating right and exercise are an easy cheat code to a happy life.",
                "image": "/health.png"
            },
            {
                "name": "Cooking",
                "description": "I've recently gotten into cooking. Honestly it kind of feels like programming sometimes, taking tools and ingredients and making something amazing from nothing.",
                "image": "/cooking.avif"
            },
            {
                "name": "Homelab",
                "description": "I set up a home server using proxmox and TrueNAS a while ago and absolutely love it. There is just something about owning my own data and not needing to rely on the cloud for everything.",
                "image": "/homelab.jpg"
            },
            {
                "name": "Travel",
                "description": "Seeing new places and experiencing new things is the best. To date I've been to most states on the east coast, Texas, California, Bermuda, Puerto Rico, Puerto Vallarta Mexico, and Japan.",
                "image": "/travel.jpeg"
            }
        ],
        "timeline": [
            {
                "year": "2001",
                "description": "I was originally born in Daytona beach Florida where I spent the first few years of my life. I don't remember too much from that time, only hiding in my nursery with a dresser in front of the window as hurricane Charley beat down on us. From here started a long series of moves up and down the east coast.",
                "image": ""
            },
            {
                "year": "2004",
                "description": "The first destination was Michigan were we lived in Roscommon for a few years, this is where I started preschool.",
                "image": ""
            },
            {
                "year": "2007",
                "description": "Moved to Fairfax, Virginia, where I learned how to swim and started kindergarten.",
                "image": ""
            },
            {
                "year": "2008",
                "description": "Moved back to Florida, this time living on Merritt Island the space coast. I remember watching shuttle launches from my driveway with my friends.",
                "image": ""
            },
            {
                "year": "2011",
                "description": "Moved to Annapolis, Maryland where I started fourth grade. Lived here for a while getting to finish elementary and middle school before moving my Junior year of high school.",
                "image": ""
            },
            {
                "year": "2013",
                "description": "Got my family dog Bella!",
                "image": "/bella.jpg"
            },
            {
                "year": "2018",
                "description": "Moved to Virginia Beach, Virginia.",
                "image": ""
            },
            {
                "year": "2020",
                "description": "Graduated from Landstown High School in Virginia Beach before moving to Albany, New York during the summer. Later that fall I got to start my college career at Rochester Institute of Technology.",
                "image": "/2020graduation.jpg"
            },
            {
                "year": "2024",
                "description": "Me and my friend went to Japan.",
                "image": "/japan.jpg"
            },
            {
                "year": "2025",
                "description": "Graduated from Rochester Institute of Technology with my degree in Computer Science.",
                "image": "/2025graduation.jpg"
            }
        ]
    },
    "skills": [
        {
            "name": "Python",
            "category": "Languages",
            "percent": "100",
            "description": "Have been programming in Python for over 5 years now. Used it in countless projects from making simple API servers to training AI models. Most recently used Python at my co-op with Precision Optical Technologies."
        },
        {
            "name": "Java",
            "category": "Languages",
            "percent": "100",
            "description": "Java was the first programming language I learned. Even though I haven't used it much recently Java was my foundation and I've made plenty of projects with it over the past 7 years since learning it."
        },
        {
            "name": "C#",
            "category": "Languages",
            "percent": "100",
            "description": "Being similar to Java, C# was a simple jump. I took an entire course on C# and .NET development in college and used it to create DLLs for MKS while I co-oped there."
        },
        {
            "name": "Javascript",
            "category": "Languages",
            "percent": "100",
            "description": "Got my start with Javascript from a Software Engineering class in college and reinforced what I learned in school with hands on experience developing a internal website while on co-op at Precision Optical Technologies."
        },
        {
            "name": "Typescript",
            "category": "Languages",
            "percent": "100",
            "description": "Learned Typescript when I had to use Angular for a school project and then reinforced that skill working on a Electron application for Precision Optical Technologies."
        },
        {
            "name": "HTML",
            "category": "Languages",
            "percent": "100",
            "description": "Got my start with HTML from a Software Engineering class in college and reinforced what I learned in school with hands on experience developing a internal website while on co-op at Precision Optical Technologies."
        },
        {
            "name": "CSS",
            "category": "Languages",
            "percent": "100",
            "description": "Got my start with CSS from a Software Engineering class in college and reinforced what I learned in school with hands on experience developing a internal website while on co-op at Precision Optical Technologies."
        },
        {
            "name": "Visual Basic",
            "category": "Languages",
            "percent": "100",
            "description": "Learned Visual Basic when I worked for MKS, working on legacy libraries written in the language."
        },
        {
            "name": "C",
            "category": "Languages",
            "percent": "100",
            "description": "Learned C in one of my college classes, writing multiple projects for the class. Later applied what I learned on my co-op at Precision Optical Technologies when I debugged C code that ran their Tuning boxes."
        },
        {
            "name": "SQL",
            "category": "Frameworks and Tools",
            "percent": "100",
            "description": "Learned SQL in my Database systems class in college. Most of my work experience involved using Django for database management, but I would utilize SQL to view the database and test what I wanted to implement in Python."
        },
        {
            "name": "Troubleshooting Virtual Machines",
            "category": "Frameworks and Tools",
            "percent": "75",
            "description": "I run my own homelab with Proxmox and have multiple virtual machines to handle different aspects of my homelab."
        },
        {
            "name": "Django",
            "category": "Frameworks and Tools",
            "percent": "100",
            "description": "Worked on companies internal website built with Django during my co-op at Precision Optical Technologies."
        },
        {
            "name": "React",
            "category": "Frameworks and Tools",
            "percent": "50",
            "description": "Used React Native when working on the Android app for Precision Optical Technologies."
        },
        {
            "name": "GIT",
            "category": "Frameworks and Tools",
            "percent": "100",
            "description": "Been using GIT for version control in both school and work for years now."
        },
        {
            "name": ".NET",
            "category": "Frameworks and Tools",
            "percent": "75",
            "description": "Took a class in college focused on .NET principles and development, along with working on it during my MKS co-op."
        },
        {
            "name": "Perforce",
            "category": "Frameworks and Tools",
            "percent": "80",
            "description": "Was used instead of GIT for version control at MKS."
        },
        {
            "name": "Firebase",
            "category": "Frameworks and Tools",
            "percent": "60",
            "description": "Used for the backend to the Haikumi app I worked on."
        },
        {
            "name": "PostgresSQL",
            "category": "Frameworks and Tools",
            "percent": "90",
            "description": "Used for personal projects."
        },
        {
            "name": "MySQL",
            "category": "Frameworks and Tools",
            "percent": "90",
            "description": "Worked with during co-op with Precision Optical Technologies."
        },
        {
            "name": "Unit Testing",
            "category": "Frameworks and Tools",
            "percent": "85",
            "description": "Wrote unit tests for both MKS and Precision Optical Technologies."
        },
        {
            "name": "API",
            "category": "Frameworks and Tools",
            "percent": "100",
            "description": "Wrote APIs for both college classes and at Precision Optical Technologies."
        },
        {
            "name": "Docker",
            "category": "DevOps and Infrastructure",
            "percent": "85",
            "description": "Wrote docker and docker compose files at Precision Optical Technologies, along with container management both on co-op and for my own personal homelab."
        },
        {
            "name": "Portainer",
            "category": "DevOps and Infrastructure",
            "percent": "90",
            "description": "Tool of choice for managing docker installations."
        },
        {
            "name": "Cloudflare",
            "category": "DevOps and Infrastructure",
            "percent": "35",
            "description": "I've mostly worked with their Zerotrust access for serving my homelab services to the internet without needing to port forward myself."
        },
        {
            "name": "Network Tunneling",
            "category": "DevOps and Infrastructure",
            "percent": "50",
            "description": "Setup personal VPNs."
        },
        {
            "name": "Port Management",
            "category": "DevOps and Infrastructure",
            "percent": "100",
            "description": "Worked on school projects requiring proper port configuration, along with port forwarding on my own personal network."
        },
        {
            "name": "Customer Computer Hardware Assembly",
            "category": "DevOps and Infrastructure",
            "percent": "85",
            "description": "Built multiple computers."
        },
        {
            "name": "Ubuntu",
            "category": "Operating Systems",
            "percent": "70",
            "description": "Developed software in Ubuntu, and dual boot my personal PC with Ubuntu and Windows."
        },
        {
            "name": "Ubuntu Server",
            "category": "Operating Systems",
            "percent": "70",
            "description": "The OS I chose when setting up my homelab for my docker VM specifically."
        },
        {
            "name": "Proxmox",
            "category": "Operating Systems",
            "percent": "60",
            "description": "Used as the basis for my homelab."
        },
        {
            "name": "TrueNAS Scale",
            "category": "Operating Systems",
            "percent": "60",
            "description": "Setup on my homelab for network storage."
        },
        {
            "name": "Windows home",
            "category": "Operating Systems",
            "percent": "100",
            "description": "The operating system I have daily driven for years."
        },
        {
            "name": "Windows Server",
            "category": "Operating Systems",
            "percent": "90",
            "description": "Worked with it on co-op at MKS."
        },
        {
            "name": "Flutter",
            "category": "Frameworks and Tools",
            "percent": "50",
            "description": "The framework utilized when developing Haikumi at my Mimio internship."
        },
        {
            "name": "Dart",
            "category": "Languages",
            "percent": "50",
            "description": "The language Flutter uses, and what I used when developing Haikumi at my Mimio internship."
        },
        {
            "name": "MacOS",
            "category": "Operating Systems",
            "percent": "80",
            "description": "Daily driven MacOS and used for development."
        },
        {
            "name": "Next.js",
            "category": "Frameworks and Tools",
            "percent": "60",
            "description": "Used when building this website."
        },
        {
            "name": "Adaptability",
            "category": "Other",
            "percent": "100",
            "description": "If you take a look at my about me timeline you'll see I've moved around quite a lot causing me to become very adaptable."
        },
        {
            "name": "Communication",
            "category": "Other",
            "percent": "100",
            "description": "Did my immersion in communication at Rochester Institute of Technology, and applied these learned skills on co-ops when collaborating with other departments on various projects."
        },
        {
            "name": "Organization",
            "category": "Other",
            "percent": "100",
            "description": ""
        }
    ],
    "projects": [
        {
            "title": "Porthole Desktop Environment",
            "summary": "Taskbar widget that makes up the users desktop",
            "about": "A Quickshell based widget that when combined with Hyprland makes up the desktop experience of Porthole.",
            "tags": [
                "Quickshell",
                "QML",
                "Bash"
            ],
            "image": "/PortholeDE.png",
            "link": "https://github.com/Drs2001/PortholeDE"
        },
        {
            "title": "Porthole Settings",
            "summary": "Simple settings app used to configure Porthole",
            "about": "An application that allows the user to configure and customize various aspects of the Porthole Distro.",
            "tags": [
                "Python",
                "QML",
                "JSON",
                "Bash"
            ],
            "image": "/PortholeSettings.png",
            "link": "https://github.com/Drs2001/PortholeSettings"
        },
        {
            "title": "Haikumi",
            "summary": "Ever wanted to message in Haiku form?",
            "about": "Haikumi is a messaging app that allows users to communicate through Haikus.",
            "tags": [
                "Flutter",
                "Dart",
                "Firebase"
            ],
            "image": "/haikumi.png",
            "link": "https://haikumi.app/"
        },
        {
            "title": "Wordle Solver",
            "summary": "Simple application to solve Wordles",
            "about": "An application that filters words based on guesses in Wordle to return a limited list of possible 5 letter words it can be.",
            "tags": [
                "Java"
            ],
            "image": "/wordl.png",
            "link": "https://github.com/Drs2001/WordleSolver"
        },
        {
            "title": "Porthole Scripts",
            "summary": "A collection of Bash scripts used to build Porthole.",
            "about": "Bash scripts meant to be run on a fresh install of Arch linux. They install required packages, and configure dot files to build the Porthole desktop experience.",
            "tags": [
                "Bash"
            ],
            "image": "/PortholeScript.png",
            "link": "https://github.com/Drs2001/Porthole"
        },
        {
            "title": "Remarkable File Explorer",
            "summary": "Simple file explorer for the Remarkable Tablet.",
            "about": "An application that interfaces with the remarkable tablet filesystem and displays it in an easy to use GUI for viewing and downloading documents.",
            "tags": [
                "Python",
                "PyQt",
                "API Requests"
            ],
            "image": "/rmFileExplorer.png",
            "link": "https://github.com/Drs2001/RemarkableFileExplorer"
        },
        {
            "title": "Voice over UDP",
            "summary": "Simple voice chat application.",
            "about": "An application that allows for voice chat over UDP, making a connection to the server using TCP handshake then once connection is established allows for voice chat communication over UDP with different clients connected. ",
            "tags": [
                "Python",
                "Networking",
                "Port Management"
            ],
            "image": "/tcpvoice.png",
            "link": "https://github.com/Drs2001/VoiceOverTCP"
        }
    ],
    "education": {
        "summary": "Graduated from Rochester Institute of Technology in May of 2025 with a Bachelor's degree in Computer Science.",
        "gpa": "3.5",
        "classes": [
            {
                "name": "Intro to Artificial Intelligence",
                "courseNumber": "CSCI 331",
                "grade": "A",
                "description": "An introduction to the theories and algorithms used to create artificial intelligence (AI) systems. Topics include search algorithms, logic, planning, machine learning, and applications from areas such as computer vision, robotics, and natural language processing."
            },
            {
                "name": "Programming Skills (Design patterns in C#/.NET)",
                "courseNumber": "CSCI 541",
                "grade": "B+",
                "description": "The goal of this course is to introduce the students to a programming paradigm and an appropriate programming language chosen from those that are currently important or that show high promise of becoming important. A significant portion of the learning curve occurs through programming assignments with exemplary solutions discussed later in class. "
            },
            {
                "name": "Intro to Cryptography",
                "courseNumber": "CSCI 462",
                "grade": "A-",
                "description": "This course provides an introduction to cryptography, its mathematical foundations, and its relation to security. It covers classical cryptosystems, private-key cryptosystems (including DES and AES), hashing and public-key cryptosystems (including RSA). The course also provides an introduction to data integrity and authentication. "
            },
            {
                "name": "Database System Implementation",
                "courseNumber": "CSCI 421",
                "grade": "A-",
                "description": "This course provides a broad introduction to database management systems including data modeling, the relational model, and SQL. Database system implementation issues are covered next, where the focus is on data structures and algorithms used to implement database management systems. Topics include physical data organization, indexing and hashing, query processing and optimization, database recovery techniques, transaction management, concurrency control, and database performance evaluation. "
            },
            {
                "name": "Principles of Data Management",
                "courseNumber": "CSCI 320",
                "grade": "B",
                "description": "This course provides a broad introduction to the principles and practice of modern data management, with an emphasis on the relational database model. Topics in relational database systems include data modeling; the relational model; relational algebra; Structured Query Language (SQL); and data quality, transactions, integrity and security. Students will also learn approaches to building relational database application programs. Additional topics include object-oriented and object-relational databases; semi-structured databases (such as XML); and information retrieval. "
            },
            {
                "name": "Concepts of Parallel and Distributed Systems",
                "courseNumber": "CSCI 251",
                "grade": "A",
                "description": "This course is an introduction to the organization and programming of systems comprising multiple computers. Topics include the organization of multi-core computers, parallel computer clusters, computing grids, client-server systems, and peer-to-peer systems; computer networks and network protocols; network security; multi-threaded programming; and network programming. "
            },
            {
                "name": "Concepts of Computer Systems",
                "courseNumber": "CSCI 250",
                "grade": "B-",
                "description": "An introduction to the hardware and software organization of computer systems. The course emphasizes a multilevel model of computer organization. Topics include the digital logic level; the micro architecture level; the machine instruction set level; the operating system level; and the assembly language level."
            },
            {
                "name": "Historical and Current Computer Science",
                "courseNumber": "CSCI 472",
                "grade": "A-",
                "description": "Students who have a background in Computer Science theories, algorithms, and data structures will be provided a look at the history of Computer Science from historical and current perspectives. Topics include an early history of Computer Science, a study of the people who shaped Computer Science, and a discussion of major milestones in Computer Science. Additionally, students will study current issues in Computer Science, including legal, ethical, diversity, equity, inclusion, accessibility and privacy issues, and how past issues affect modern designs and decision making by computer scientists. "
            },
            {
                "name": "Programming Language Concepts",
                "courseNumber": "CSCI 344",
                "grade": "A-",
                "description": "This course is a study of the syntax and semantics of a diverse set of high-level programming languages. The languages chosen are compared and contrasted in order to demonstrate general principles of programming language design and implementation. The course emphasizes the concepts underpinning modern languages rather than the mastery of particular language details."
            },
            {
                "name": "Data Communication and Networks",
                "courseNumber": "CSCI 351",
                "grade": "A",
                "description": "This course is an in-depth study of data communications and networks. The course covers design of, and algorithms and protocols used in, the physical, data link, network, transport, and application layers in the Internet; methods for modeling and analyzing networks, including graphs, graph algorithms, and discrete event simulation; and an introduction to network science."
            },
            {
                "name": "The Mechanics of Programming",
                "courseNumber": "CSCI 243",
                "grade": "B-",
                "description": "Students will be introduced to the details of program structure and the mechanics of execution as well as supportive operating system features. Security and performance issues in program design will be discussed. The program translation process will be examined."
            },
            {
                "name": "Intro to Computer Science Theory",
                "courseNumber": "CSCI 262",
                "grade": "A-",
                "description": "This course provides an introduction to the theory of computation, including formal languages, grammars, automata theory, computability, and complexity. "
            },
            {
                "name": "Intro to Software Engineering",
                "courseNumber": "SWEN 261",
                "grade": "B",
                "description": "An introductory course in software engineering, emphasizing the organizational aspects of software development and software design and implementation by individuals and small teams within a process/product framework. Topics include the software lifecycle, software design, user interface issues, specification and implementation of components, assessing design quality, design reviews and code inspections, software testing, basic support tools, technical communications and system documentation, team-based development. "
            },
            {
                "name": "Analysis of Algorithms",
                "courseNumber": "CSCI 261",
                "grade": "SE",
                "description": "This course provides an introduction to the design and analysis of algorithms. It covers a variety of classical algorithms and data structures and their complexity and will equip students with the intellectual tools to design, analyze, implement, and evaluate their own algorithms."
            },
            {
                "name": "Computer Science for AP Students",
                "courseNumber": "CSCI 140",
                "grade": "B+",
                "description": "The course stresses problem solving while covering modern software development techniques and introducing essential software tools. Topics include tree and graph structures, nested data structures, objects, classes, inheritance, interfaces, object-oriented collection class libraries for abstract data types (e.g. stacks, queues, maps, and trees), and static vs. dynamic data types. Concepts of object-oriented design are a large part of the course. Software qualities related to object orientation, namely cohesion, minimal coupling, modifiability, and extensibility, are all introduced in this course, as well as a few elementary object-oriented design patterns. Input and output streams, graphical user interfaces, and exception handling are covered."
            },
            {
                "name": "Human Communication",
                "courseNumber": "COMM 101",
                "grade": "A-",
                "description": "An introduction to the theoretical and conceptual underpinnings of oral, visual, and written communication. Introduces basic communication models, the role of language in communication, symbols and symbol making, issues of audience analysis, and the development of different modes of discourse. Also explores the history of communication and introduces students to basic principles and research in communication studies. "
            },
            {
                "name": "Mass Communications",
                "courseNumber": "COMM 202",
                "grade": "A",
                "description": "The history and development of U.S. media, theoretical aspects of mass communications, the composition of media audiences, law and regulation of mass communications and how the media affect and are affected by society are presented."
            },
            {
                "name": "Principles of Advertising",
                "courseNumber": "COMM 211",
                "grade": "A-",
                "description": "An introduction to principles and practices of advertising. Topics include advertising theories, ethics, regulation, consumer research, media planning, message strategy, and campaign planning strategy."
            },
            {
                "name": "Digital Design in Comm.",
                "courseNumber": "COMM 223",
                "grade": "A",
                "description": "In an increasingly visual culture, and culture of online user-created content, non-designers are called upon in the professional realm to illustrate their ideas. Graduates entering the workforce will encounter situations where they will benefit from possessing a visual communication sensibility and vocabulary to communicate effectively with a broad range of audiences, including professional designers. Creative approaches to challenges, such as visual thinking, are also shown to improve students’ comprehension and problem-solving abilities. Digital Design in Communication is an opportunity for undergraduates to receive an introduction to principles of visual message design from a critical rhetorical perspective. They will also get the opportunity to apply these principles to a variety of visual products such as advertisements, logos, brochures, resumes, etc. A variety of computer software applications are available to support the research, writing, visualization, and design of messages. "
            },
            {
                "name": "Tech-Mediated Communication",
                "courseNumber": "COMM 343",
                "grade": "A",
                "description": "Technology-mediated communication (TMC) was originally defined as a form of electronic written communication. As networking tools advanced, TMC expanded to include new software developments, such as instant messenger and the web. Today, the term technology-mediated communication is used to refer to a wide range of technologies that facilitate both human communication and the interactive sharing of information through computer networks. Through readings, discussions, and observations of online behavior, students will be introduced to TMC terms and theories to further develop their TMC communication and critical thinking skills."
            }
        ]
    }
}