{
    "personal_info": 
    {
        "first_name": "Dylan",
        "last_name": "Spence", 
        "email": "dylanspence705607@gmail.com",
        "phonenumber": "+1 321-292-4540"
    },
    "links":
    {
        "github": "https://github.com/Drs2001",
        "linkedin": "https://www.linkedin.com/in/dylan-spence-999036234/"
    },
    "experience":
    [
        {
            "company": "Precision Optical Technologies",
            "location": "Rochester, NY",
            "dates": "January 2024 - August 2024",
            "title": "Software Engineering Co-op",
            "description": "Added internal data analytic features to web server, providing actionable insights for the production, sales, and engineering teams. Collaborated on cross-platform (iOS, Android, Windows) app development used by customers to interface with custom hardware.",
            "link": "https://www.precisionot.com/"
        },
        {
            "company": "MKS Instruments",
            "location": "Rochester, NY",
            "dates": "January 2023 - July 2023",
            "title": "Software Engineering Co-op",
            "description": "Developed automation scripts to generate Windows .exe installers for various projects, significantly improving testing efficiency for the team. Additionally, contributed to the development and maintenance of the core DLL shared by all RF generators.",
            "link": "https://www.mks.com/"
        },
        {
            "company": "Mimio LLC",
            "location": "Remote",
            "dates": "July 2022 - December 2022",
            "title": "App Developer",
            "description": "Designed and implemented the underlying architecture of a cross-platform messaging application. Developed a novel syllable analysis engine for identifying Haiku poems within messages.",
            "link": "https://apps.apple.com/us/app/haikumi/id1632097536"
        }
    ],
    "about":
    {
        "summary": "From a young age, I’ve been driven by curiosity—taking apart phones, computers, and any electronics I could find to understand how they work. That passion led me to pursue a degree in Computer Science, where I’ve channeled my inquisitive nature into mastering how computers work, exploring the best technologies for specific applications, and optimizing efficiency in software solutions. I've been fortunate to intern at some great companies while pursuing my degree in Computer Science. These companies really helped me to take the skills I learned in the classroom and apply them in a practical setting. I started off with mobile app development, crafting a modern app using Flutter and Firebase to meet client specs. At MKS, I worked as a .NET developer, enhancing DLL libraries for RF generators and streamlining processes with Jenkins and JavaScript automation scripts. Most recently, at Precision Optical Technologies, I tackled everything from embedded C development and Django-based data analytics to Electron cross-platform apps, React Android development, Docker containerization, and Python APIs for engineering workflows. I’m passionate about writing efficient, impactful code and thrive in dynamic, problem-solving environments. My goal? To join a forward-thinking team where I can contribute to innovative software solutions. When I’m not coding, I’m managing and improving my homelab with a goal of de-googling my life. Let’s connect to talk tech, opportunities, or the next big project!",
        "interests": [
            {
                "name": "Soccer",
                "image": "/soccer.avif",
                "description": "I played soccer for about 12 years before stopping my senior year of high school after covid hit. Even though I no longer play I still like catching a BPL game every now and again. (The teams I root for are D.C United for MLS and Manchester United for BPL)"
            },
            {
                "name": "Pickleball",
                "image": "/pickleball.jpg",
                "description": "Only recently got into this sport, I enjoy playing casually with my friends when I get the chance."
            },
            {
                "name": "Bouldering",
                "image": "/bouldering.jpg",
                "description": "Been bouldering consistently for nearly 3 years now and absolutly love it. Bouldering is essentially rock climbing without a rope on shorter routes. I like to go to the gym around 3 times a week if I'm able. (If your curious my current record for grade is V7 but difficulty depends a lot on setters.)"
            },
            {
                "name": "Health/ Fitness",
                "description": "If you couldn't tell by the amount of sports I have for hobbies I'm really into my health and fitness. Eating right and excersize are a easy cheat code to a happy life.",
                "image": "/health.png"
            },
            {
                "name": "Cooking",
                "description": "I've recently gotten into cooking. Honestly it kind of feels like programming sometimes, taking tools and ingridients and making something amazing from nothing.",
                "image": "/cooking.avif"
            },
            {
                "name": "Homelab",
                "description": "I set up a home server using proxmox and TrueNAS a while ago and absolutly love it. There is just something about owning my own data and not needing to rely on the cloud for everything.",
                "image": "/homelab.jpg"
            },
            {
                "name": "Travel",
                "description": "Seeing new places and experiencing new things is the best. To date I've been to most states on the east coast, Texas, California, Bermuda, Puerto Rico, Puerto Vallarta Mexico, and Japan.",
                "image": "/travel.jpeg"
            }
        ],
        "timeline": [
            {
                "year": "2001",
                "description": "I was origionally born in Daytona beach Florida where I spent the first few years of my life. I dont remember too much from that time, only hiding in my nursery with a dresser in front of the window as hurricane Charely beat down on us. From here started a long series of moves up and down the east coast."
            },
            {
                "year": "2004",
                "description": "The first destination was Michigan were we lived in Roscommon for a few years, this is where I started preschool."
            },
            {
                "year": "2007",
                "description": "Moved to Fairfax, Virginia, where I learned how to swim and started kindergarten."
            },
            {
                "year": "2008",
                "description": "Moved back to Florida, this time living on Merrit Island the space coast. I remember watching shuttle launches from my driveway with my friends."
            },
            {
                "year": "2011",
                "description": "Moved to Annapolis, Maryland where I started fourth grade. Lived here for a while getting to finish elementry and middle school before moving my Junior year of highschool."
            },
            {
                "year": "2018",
                "description": "Moved to Virginia Beach, Virginia where I got to graduate from highschool."
            },
            {
                "year": "2020",
                "description": "Graduated from Landstown Highschool in Virgnia Beach before moving to Albany, New York during the summer. Later that fall I got to start my college career at Rochester Institute of Technology."
            },
            {
                "year": "2025",
                "description": "Graduated from Rochester Institute of Technology with my degree in Computer Science."
            }
        ]
    },
    "skills":
    [
        {
            "name": "Python",
            "category": "Languages",
            "percent": "100"
        },
        {
            "name": "Java",
            "category": "Languages",
            "percent": "100"
        },
        {
            "name": "C#",
            "category": "Languages",
            "percent": "100"
        },
        {
            "name": "Javascript",
            "category": "Languages",
            "percent": "100"
        },
        {
            "name": "Typescript",
            "category": "Languages",
            "percent": "100"
        },
        {
            "name": "HTML",
            "category": "Languages",
            "percent": "100"
        },
        {
            "name": "CSS",
            "category": "Languages",
            "percent": "100"
        },
        {
            "name": "Visual Basic",
            "category": "Languages",
            "percent": "100"
        },
        {
            "name": "C",
            "category": "Languages",
            "percent": "100"
        },
        {
            "name": "SQL",
            "category": "Frameworks and Tools",
            "percent": "100"
        },
        {
            "name": "Troubleshooting Virtual Machines",
            "category": "Frameworks and Tools",
            "percent": "75"
        },
        {
            "name": "Django",
            "category": "Frameworks and Tools",
            "percent": "100"
        },
        {
            "name": "Angular",
            "category": "Frameworks and Tools",
            "percent": "40"
        },
        {
            "name": "React",
            "category": "Frameworks and Tools",
            "percent": "50"
        },
        {
            "name": "GIT",
            "category": "Frameworks and Tools",
            "percent": "100"
        },
        {
            "name": ".NET",
            "category": "Frameworks and Tools",
            "percent": "75"
        },
        {
            "name": "Perforce",
            "category": "Frameworks and Tools",
            "percent": "80"
        },
        {
            "name": "Firebase",
            "category": "Frameworks and Tools",
            "percent": "60"
        },
        {
            "name": "PostgresSQL",
            "category": "Frameworks and Tools",
            "percent": "90"
        },
        {
            "name": "MySQL",
            "category": "Frameworks and Tools",
            "percent": "90"
        },
        {
            "name": "Unit Testing",
            "category": "Frameworks and Tools",
            "percent": "85"
        },
        {
            "name": "API",
            "category": "Frameworks and Tools",
            "percent": "100"
        },
        {
            "name": "Docker",
            "category": "DevOps and Infastructure",
            "percent": "85"
        },
        {
            "name": "Portainer",
            "category": "DevOps and Infastructure",
            "percent": "90"
        },
        {
            "name": "Cloudflare",
            "category": "DevOps and Infastructure",
            "percent": "35"
        },
        {
            "name": "Network Tunneling",
            "category": "DevOps and Infastructure",
            "percent": "50"
        },
        {
            "name": "Port Management",
            "category": "DevOps and Infastructure",
            "percent": "100"
        },
        {
            "name": "Customer Computer Hardware Assembly",
            "category": "DevOps and Infastructure",
            "percent": "85"
        },
        {
            "name": "Ubuntu",
            "category": "Operating Systems",
            "percent": "70"
        },
        {
            "name": "Ubuntu Server",
            "category": "Operating Systems",
            "percent": "70"
        },
        {
            "name": "Proxmox",
            "category": "Operating Systems",
            "percent": "60"
        },
        {
            "name": "TrueNAS Scale",
            "category": "Operating Systems",
            "percent": "60"
        },
        {
            "name": "Windows home",
            "category": "Operating Systems",
            "percent": "100"
        },
        {
            "name": "Windows Server",
            "category": "Operating Systems",
            "percent": "90"
        },
        {
            "name": "Flutter",
            "category": "Frameworks and Tools",
            "percent": "50"
        },
        {
            "name": "Dart",
            "category": "Languages",
            "percent": "50"
        },
        {
            "name": "MacOS",
            "category": "Operating Systems",
            "percent": "80"
        },
        {
            "name": "Next.js",
            "category": "Frameworks and Tools",
            "percent": "60"
        },
        {
            "name": "Adaptability",
            "category": "Other",
            "percent": "100"
        }
    ],
    "projects":
    [
        {
            "title": "Haikumi",
            "summary": "Ever wanted to message in Haiku form?",
            "about": "Haikumi is a messaging app that allows users to communicate through Haikus.",
            "tags": ["Flutter", "Dart", "Firebase"],
            "image": "/haikumi.png",
            "link": "https://haikumi.app/"
        },
        {
            "title": "Remarkable File Explorer",
            "summary": "Simple file explorer for the Remarkable Tablet.",
            "about": "A application that interfaces with the remarkable tablet filesystem and displays it in a easy to use GUI for viewing and downloading documents.",
            "tags": ["Python", "PyQt", "API Requests"],
            "image": "/rmFileExplorer.png",
            "link": "https://github.com/Drs2001/RemarkableFileExplorer"
        }
    ],
    "education":
    {
        "summary": "Graduated from Rochester Institute of Technology in May of 2025 with a Bacholers degree in Computer Science.",
        "gpa": "3.5",
        "classes": [
        {
            "name": "Computer Science for AP Students",
            "courseNumber": "CSCI 140",
            "grade": "B+",
            "description": "The course stresses problem solving while covering modern software development techniques and introducing essential software tools. Topics include tree and graph structures, nested data structures, objects, classes, inheritance, interfaces, object-oriented collection class libraries for abstract data types (e.g. stacks, queues, maps, and trees), and static vs. dynamic data types. Concepts of object-oriented design are a large part of the course. Software qualities related to object orientation, namely cohesion, minimal coupling, modifiability, and extensibility, are all introduced in this course, as well as a few elementary object-oriented design patterns. Input and output streams, graphical user interfaces, and exception handling are covered."
        },
        {
            "name": "The Mechanics of Programming",
            "courseNumber": "CSCI 243",
            "grade": "B-",
            "description": "Students will be introduced to the details of program structure and the mechanics of execution as well as supportive operating system features. Security and performance issues in program design will be discussed. The program translation process will be examined."
        },
        {
            "name": "Intro to Computer Science Theory",
            "courseNumber": "CSCI 262",
            "grade": "A-",
            "description": "This course provides an introduction to the theory of computation, including formal languages, grammars, auto-mata theory, computability, and complexity. "
        },
        {
            "name": "Intro to Software Engineering",
            "courseNumber": "SWEN 261",
            "grade": "B",
            "description": "An introductory course in software engineering, emphasizing the organizational aspects of software development and software design and implementation by individuals and small teams within a process/product framework. Topics include the software lifecycle, software design, user interface issues, specification and implementation of components, assessing design quality, design reviews and code inspections, software testing, basic support tools, technical communications and system documentation, team-based development. "
        },
        {
            "name": "Principles of Data Management",
            "courseNumber": "CSCI 320",
            "grade": "B",
            "description": "This course provides a broad introduction to the principles and practice of modern data management, with an emphasis on the relational database model. Topics in relational database systems include data modeling; the relational model; relational algebra; Structured Query Language (SQL); and data quality, transactions, integrity and security. Students will also learn approaches to building relational database application programs. Additional topics include object-oriented and object-relational databases; semi-structured databases (such as XML); and information retrieval. "
        },
        {
            "name": "Concepts of Parallel and Distributed Systems",
            "courseNumber": "CSCI 251",
            "grade": "A",
            "description": "This course is an introduction to the organization and programming of systems comprising multiple computers. Topics include the organization of multi-core computers, parallel computer clusters, computing grids, client-server systems, and peer-to-peer systems; computer networks and network protocols; network security; multi-threaded programming; and network programming. "
        },
        {
            "name": "Concepts of Computer Systems",
            "courseNumber": "CSCI 250",
            "grade": "B-",
            "description": "An introduction to the hardware and software organization of computer systems. The course emphasizes a multilevel model of computer organization. Topics include the digital logic level; the micro architecture level; the machine instruction set level; the operating system level; and the assembly language level."
        },
        {
            "name": "Historical and Current Computer Science",
            "courseNumber": "CSCI 472",
            "grade": "A-",
            "description": "Students who have a background in Computer Science theories, algorithms, and data structures will be provided a look at the history of Computer Science from historical and current perspectives. Topics include an early history of Computer Science, a study of the people who shaped Computer Science, and a discussion of major milestones in Computer Science. Additionally, students will study current issues in Computer Science, including legal, ethical, diversity, equity, inclusion, accessibility and privacy issues, and how past issues affect modern designs and decision making by computer scientists. "
        },
        {
            "name": "Programming Language Concepts",
            "courseNumber": "CSCI 344",
            "grade": "A-",
            "description": "This course is a study of the syntax and semantics of a diverse set of high-level programming languages. The languages chosen are compared and contrasted in order to demonstrate general principles of programming language design and implementation. The course emphasizes the concepts underpinning modern languages rather than the mastery of particular language details."
        },
        {
            "name": "Intro to Artificial Intelligence",
            "courseNumber": "CSCI 331",
            "grade": "A",
            "description": "An introduction to the theories and algorithms used to create artificial intelligence (AI) systems. Topics include search algorithms, logic, planning, machine learning, and applications from areas such as computer vision, robotics, and natural language processing."
        },
        {
            "name": "Programming Skills (Design patterns in C#/.NET)",
            "courseNumber": "CSCI 541",
            "grade": "B+",
            "description": "The goal of this course is to introduce the students to a programming paradigm and an appropriate programming language chosen from those that are currently important or that show high promise of becoming important. A significant portion of the learning curve occurs through programming assignments with exemplary solutions discussed later in class. "
        },
        {
            "name": "Intro to Cryptography",
            "courseNumber": "CSCI 462",
            "grade": "A-",
            "description": "This course provides an introduction to cryptography, its mathematical foundations, and its relation to security. It covers classical cryptosystems, private-key cryptosystems (including DES and AES), hashing and public-key cryptosystems (including RSA). The course also provides an introduction to data integrity and authentication. "
        },
        {
            "name": "Database System Implementation",
            "courseNumber": "CSCI 421",
            "grade": "A-",
            "description": "This course provides a broad introduction to database management systems including data modeling, the relational model, and SQL. Database system implementation issues are covered next, where the focus is on data structures and algorithms used to implement database management systems. Topics include physical data organization, indexing and hashing, query processing and optimization, database recovery techniques, transaction management, concurrency control, and database performance evaluation. "
        },
        {
            "name": "Data Communication and Networks",
            "courseNumber": "CSCI 351",
            "grade": "A",
            "description": "This course is an in-depth study of data communications and networks. The course covers design of, and algorithms and protocols used in, the physical, data link, network, transport, and application layers in the Internet; methods for modeling and analyzing networks, including graphs, graph algorithms, and discrete event simulation; and an introduction to network science."
        },
        {
            "name": "Analysis of Algorithms",
            "courseNumber": "CSCI 261",
            "grade": "SE",
            "description": "This course provides an introduction to the design and analysis of algorithms. It covers a variety of classical algorithms and data structures and their complexity and will equip students with the intellectual tools to design, analyze, implement, and evaluate their own algorithms."
        }
    ]
    }


    
}